tutorials/multiphase/driftFluxFoam/ras/dahl/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (sludge water);

sludge
{
    transportModel  BinghamPlastic;

    "(plastic|BinghamPlastic)Coeffs"
    {
        plasticViscosityCoeff plasticViscosityCoeff [ 0 2 -1 0 0 0 0 ] 1.1595e-07;
        plasticViscosityExponent plasticViscosityExponent [ 0 0 0 0 0 0 0 ] 179.26;

        yieldStressCoeff yieldStressCoeff [ 0 2 -2 0 0 0 0 ] 2.1137e-07;
        yieldStressExponent yieldStressExponent [ 0 0 0 0 0 0 0 ] 1050.8;
        yieldStressOffset yieldStressOffset [ 0 0 0 0 0 0 0 ] 0;

        nuMin       nuMin [ 0 2 -1 0 0 0 0 ] 1e-10;
        nuMax       nuMax [ 0 2 -1 0 0 0 0 ] 5e-3;
    }

    rho         rho [ 1 -3 0 0 0 0 0 ] 1996;
}

water
{
    transportModel  Newtonian;

    nu      nu [ 0 2 -1 0 0 0 0 ] 1.7871e-06;
    rho     rho [ 1 -3 0 0 0 0 0 ] 996;
}

relativeVelocityModel simple;

"(simple|general)Coeffs"
{
    continuousPhase water;
    V0              V0 [ 0 1 -1 0 0 0 0 ] ( 0 -0.002198 0 );
    a               a [ 0 0 0 0 0 0 0 ] 285.84;
    a1              a1 [ 0 0 0 0 0 0 0 ] 0.1;
    residualAlpha   residualAlpha [ 0 0 0 0 0 0 0 ] 0;
}


// ************************************************************************* //
